app/controllers/students_controller.rb

    def index
    @students = Student.all
---
SELECT "students".* FROM "students"

def create
    @student = Student.create(strong_params)
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Leeloo"], ["last_name", "boy"], ["created_at", "2020-11-02 07:26:55.914853"], ["updated_at", "2020-11-02 07:26:55.914853"]]

def show
    @student = Student.find_by(id: params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

def edit
    @student = Student.find_by(id: params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

def update
    @student = Student.find_by(id: params[:id])
    @student.update(strong_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "yoke"], ["updated_at", "2020-11-02 07:44:52.242053"], ["id", 6]]